БухЭксп/Catalogs/CW_МоделиТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_МоделиТС</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗагрузки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыЗагрузки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоподъемность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркаТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_МаркиТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельДвигателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МощностьДвигателяКВТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МощностьДвигателяЛС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемДвигателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемТопливногоБака</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемператураДо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемператураОт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДвигателяТС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ТипыДвигателейТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКолеснойБазы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ТипыКолесныхБазТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТранспортногоСредства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТопливныйБакОтсутствует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаРасчетаНормыРасходаТоплива</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ФормулыРасчетаНормыРасходаТоплива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемператураПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СнаряженныйВес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыТоплива</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Топливо</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ЗначенияПоказателейНормРасходаТоплива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ЗначенияПоказателейНормРасходаТоплива</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПоказателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТранспортныеСредства</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_МоделиТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПоказательРасчетаРасходаТоплива</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПоказателиРасчетаРасходаТоплива</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыТС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Автомобиль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прицеп</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительноеОборудование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ТипыДвигателейТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ТипыДвигателейТС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отсутствует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бензиновый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дизельный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Газовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Электрический</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_ПоказателиРасчетаРасходаТоплива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ПоказателиРасчетаРасходаТоплива</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УказываетсяВНастройках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСлужебный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БуквенныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_МоделиТС/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте 
Перем ИндексСтроки;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользованиеБлокаСобственногоТранспорта 	= ПолучитьФункциональнуюОпцию("CW_ИспользованиеБлокаСобственногоТранспорта");
	ПрименяютсяНормативыРасходаТоплива 			= ПолучитьФункциональнуюОпцию("CW_ПрименяютсяНормативыРасходаТоплива");	
	
	ИспользуетсяДополнительноеОборудование		= ПолучитьФункциональнуюОпцию("CW_ИспользуетсяДополнительноеОборудованиеТранспортныхСредств");
	
	Если ИспользуетсяДополнительноеОборудование тогда
		Элементы.ВидТС.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.CW_ВидыТС.ДополнительноеОборудование"));
	КонецЕсли;
	
	ОтображатьВсеПоказатели 			= истина;

	_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма);
	
	УстановитьНеобходимостьДвигателя();

	_УправлениеЭлементамиФормы();
	
	_УстановитьПараметрыФункциональныхОпцийФормы();
	
	Если ПрименяютсяНормативыРасходаТоплива и ИспользованиеБлокаСобственногоТранспорта Тогда
		
		ЗаполнитьПоказателиНормРасходаТопливаНаСервере();
		
		ОтображатьВсеПоказатели = Ложь;
		УстановитьСнятьОтборПоказателей();
		ОбновитьКартинкуКнопки();
		
	КонецЕсли; 
    //Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура _УстановитьПараметрыФункциональныхОпцийФормы()
	
	ЗначениеПараметраФункциональнойОпции = Справочники.CW_ТипыТранспортныхСредств.ПустаяСсылка();
	
	Если ИспользованиеБлокаСобственногоТранспорта Тогда
		 ЗначениеПараметраФункциональнойОпции = Объект.ТипТранспортногоСредства;
	 КонецЕсли;
	 
	ПараметрыФункциональныхОпций = Новый Структура("CW_ТипТранспортногоСредства", ЗначениепараметраФункциональнойОпции);
	УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыФункциональныхОпций);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКартинкуКнопки()
	
	Элементы.ПоказателиНормРасходаТопливаПоказатьВсеПоказатели.Пометка = Не ОтображатьВсеПоказатели;
	
КонецПроцедуры

&НаСервере
Процедура _УправлениеЭлементамиФормы()
	
	ПустойВидТС 					= Объект.ВидТС = ПредопределенноеЗначение("Перечисление.CW_ВидыТС.ПустаяСсылка"); 
	ЭтоПрицеп 						= Объект.ВидТС = ПредопределенноеЗначение("Перечисление.CW_ВидыТС.Прицеп"); 
	
	Элементы.ГруппаХарактеристикиДвигателя.Видимость 	= Не ДвигательНеПредусморен;
	Элементы.ГруппаВидыТоплива.Видимость 				= Не ДвигательНеПредусморен;
	Элементы.ГруппаОбъемТопливаногоБака.Видимость 		= Не ДвигательНеПредусморен;
	Элементы.ТипДвигателяТС.Видимость 					= Не ЭтоПрицеп;
	
	Если Не ЭтоПрицеп и Не ПустойВидТС Тогда
		
		ЭтоТягач = Объект.ВидТС = ПредопределенноеЗначение("Перечисление.CW_ВидыТС.Автомобиль"); 
		Элементы.ТопливныйБакОтсутствует.Видимость 	= Не ЭтоТягач;
		
		НуженТопливныйбак = Ложь;
		
		Если Объект.ТипДвигателяТС = ПредопределенноеЗначение("Перечисление.CW_ТипыДвигателейТС.Отсутствует") Тогда
			
			Элементы.ГруппаХарактеристикиДвигателя.Видимость 	= Ложь;
			
		Иначе
			НуженТопливныйбак = Объект.ТипДвигателяТС = ПредопределенноеЗначение("Перечисление.CW_ТипыДвигателейТС.Бензиновый") ИЛИ
								Объект.ТипДвигателяТС = ПредопределенноеЗначение("Перечисление.CW_ТипыДвигателейТС.Дизельный") 	ИЛИ
								Объект.ТипДвигателяТС = ПредопределенноеЗначение("Перечисление.CW_ТипыДвигателейТС.Газовый");
			
			
		КонецЕсли;
		
		Элементы.ГруппаОбъемТопливаногоБака.Видимость 	= НуженТопливныйбак;
		Элементы.ОбъемТопливногоБака.Видимость 			= НуженТопливныйбак и Не Объект.ТопливныйБакОтсутствует;
		Элементы.ГруппаВидыТоплива.Видимость 			= НуженТопливныйбак и Не Объект.ТопливныйБакОтсутствует;
		Элементы.ОбъемДвигателя.Видимость 				= НуженТопливныйбак;
		
		Элементы.СтраницаНормыРасхода.Видимость = НуженТопливныйбак и Не Объект.ТопливныйБакОтсутствует и ПрименяютсяНормативыРасходаТоплива;
		Элементы.ГруппаВидыТоплива.Видимость 	= НуженТопливныйбак и Не Объект.ТопливныйБакОтсутствует;

	Иначе	
		
		Элементы.СтраницаНормыРасхода.Видимость = Ложь;
		
	КонецЕсли;
	
	

КонецПроцедуры
 

&НаСервере
Процедура СброситьПометкуОсновногоТоплива()
	
	//Отменим "основное топилво" у другого элемента
	Отбор = Новый Структура("Основное", истина);
	мСтроки = Объект.ВидыТоплива.НайтиСтроки(Отбор);
	Для Каждого СтрокаТоплива из мСтроки Цикл
		СтрокаТоплива.Основное = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОсновноеТопливо(Команда)
	
	СброситьПометкуОсновногоТоплива();
	
	ТекущиеДанные = Элементы.ВидыТоплива.ТекущиеДанные;
	
	ТекущиеДанные.Основное =  Не ТекущиеДанные.Основное;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоказателиНормРасходаТопливаНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	CW_ПоказателиРасчетаРасходаТоплива.БуквенныйКод КАК БуквенныйКод,
		|	CW_ПоказателиРасчетаРасходаТоплива.Ссылка КАК ПоказательРасчетаРасходаТоплива,
		|	CW_ПоказателиРасчетаРасходаТоплива.Описание КАК Описание
		|ПОМЕСТИТЬ ВТ_ДостуныеПоказатели
		|ИЗ
		|	Справочник.CW_ПоказателиРасчетаРасходаТоплива КАК CW_ПоказателиРасчетаРасходаТоплива
		|ГДЕ
		|	НЕ CW_ПоказателиРасчетаРасходаТоплива.ПометкаУдаления
		|	И CW_ПоказателиРасчетаРасходаТоплива.УказываетсяВНастройках
		|	И ВЫБОР
		|			КОГДА НЕ &УчитыватьПогрешностьИзмеренияОстаткаТоплива
		|				ТОГДА CW_ПоказателиРасчетаРасходаТоплива.Ссылка <> ЗНАЧЕНИЕ(Справочник.CW_ПоказателиРасчетаРасходаТоплива.ПогрешностьИзмеренияОстаткаТоплива)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ПоказательРасчетаРасходаТоплива
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	CW_ЗначенияПоказателейНормРасходаТопливаСрезПоследних.Период КАК Период,
		|	CW_ЗначенияПоказателейНормРасходаТопливаСрезПоследних.ПоказательРасчетаРасходаТоплива КАК ПоказательРасчетаРасходаТоплива,
		|	CW_ЗначенияПоказателейНормРасходаТопливаСрезПоследних.ЗначениеПоказателя КАК ЗначениеПоказателя
		|ПОМЕСТИТЬ ВТ_ЗначенияПоказателей
		|ИЗ
		|	РегистрСведений.CW_ЗначенияПоказателейНормРасходаТоплива.СрезПоследних(
		|			&ДатаСреза,
		|			ОбъектРасчета = &ОбъектРасчета
		|				И ПоказательРасчетаРасходаТоплива В
		|					(ВЫБРАТЬ
		|						ВТ_ДостуныеПоказатели.ПоказательРасчетаРасходаТоплива КАК ПоказательРасчетаРасходаТоплива
		|					ИЗ
		|						ВТ_ДостуныеПоказатели КАК ВТ_ДостуныеПоказатели)) КАК CW_ЗначенияПоказателейНормРасходаТопливаСрезПоследних
		|ГДЕ
		|	CW_ЗначенияПоказателейНормРасходаТопливаСрезПоследних.ОбъектРасчета = &ОбъектРасчета
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ПоказательРасчетаРасходаТоплива
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВТ_ЗначенияПоказателей.Период, НЕОПРЕДЕЛЕНО) КАК Период,
		|	ВТ_ДостуныеПоказатели.ПоказательРасчетаРасходаТоплива КАК ПоказательРасчетаРасходаТоплива,
		|	ВТ_ДостуныеПоказатели.БуквенныйКод КАК БуквенныйКод,
		|	ЕСТЬNULL(ВТ_ЗначенияПоказателей.ЗначениеПоказателя, 0) КАК ЗначениеПоказателя,
		|	ВТ_ДостуныеПоказатели.Описание КАК Описание,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ЗначенияПоказателей.ЗначениеПоказателя, 0) = 0
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Отображать
		|ИЗ
		|	ВТ_ДостуныеПоказатели КАК ВТ_ДостуныеПоказатели
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенияПоказателей КАК ВТ_ЗначенияПоказателей
		|		ПО ВТ_ДостуныеПоказатели.ПоказательРасчетаРасходаТоплива = ВТ_ЗначенияПоказателей.ПоказательРасчетаРасходаТоплива
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_ДостуныеПоказатели.ПоказательРасчетаРасходаТоплива.Код
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ДатаСреза"		, Текущаядата());
	Запрос.УстановитьПараметр("ОбъектРасчета"	, Объект.Ссылка);
	Запрос.УстановитьПараметр("УчитыватьПогрешностьИзмеренияОстаткаТоплива", ПолучитьФункциональнуюОпцию("CW_УчитыватьПогрешностьИзмеренияОстаткаТоплива"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ПоказателиНормРасходаТоплива.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ТопливныйБакОтсутствуетПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.ВидыТоплива.Количество() = 1 Тогда
		
		СтрокаТоплива = ТекущийОбъект.ВидыТоплива[0];
		СтрокаТоплива.Основное = истина;
		
	КонецЕсли;
	
	//Температурынй режим представление
	Если Объект.ТемператураОт <> 0 и  Объект.ТемператураДо <> 0 Тогда
		ТекущийОбъект.ТемператураПредставление = "от "+Формат(Объект.ТемператураОт, "ЧДЦ=")+" до "+Формат(Объект.ТемператураДо, "ЧДЦ=")
	Иначе
		ТекущийОбъект.ТемператураПредставление = "<не указан>";	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПоказателиПослеЗакрытияФормыВыбора(РезультатВыбора, Параметр) Экспорт
	
	ЗаполнитьПоказателиНормРасходаТопливаНаСервере();
	
	Если ИндексСтроки <> Неопределено Тогда
		СтрокаТаблицы = ПоказателиНормРасходаТоплива[ИндексСтроки];
		Элементы.ПоказателиНормРасходаТоплива.ТекущаяСтрока = СтрокаТаблицы.ПолучитьИдентификатор();
		ИндексСтроки = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиНормРасходаТопливаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтрокаПоказателя = Элементы.ПоказателиНормРасходаТоплива.ТекущиеДанные;
	
	Если Не СтрокаПоказателя = Неопределено Тогда
		ИндексСтроки = ПоказателиНормРасходаТоплива.Индекс(СтрокаПоказателя);
		
		ОткрытьФормуСпискаПоказателя(СтрокаПоказателя);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура  ОткрытьФормуСпискаПоказателя(СтрокаПоказателя)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ОбъектРасчета"					, Объект.Ссылка);
	ПараметрыОтбора.Вставить("ПоказательРасчетаРасходаТоплива"	, СтрокаПоказателя.ПоказательРасчетаРасходаТоплива);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Отбор" , ПараметрыОтбора);

	ОповещениеПриЗакрытии = Новый ОписаниеОповещения("ОбновитьПоказателиПослеЗакрытияФормыВыбора", ЭтотОбъект);
	
	ОткрытьФорму("РегистрСведений.CW_ЗначенияПоказателейНормРасходаТоплива.Форма.ФормаРедактированияСписка",СтруктураПараметров,ЭтаФорма,,,,ОповещениеПриЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


&НаКлиенте
Процедура РедактироватьПоказатель(Команда)
	
	СтрокаПоказателя = Элементы.ПоказателиНормРасходаТоплива.ТекущиеДанные;  
	
	Если Не СтрокаПоказателя = Неопределено Тогда
		
		ИндексСтроки = ПоказателиНормРасходаТоплива.Индекс(СтрокаПоказателя);
		
		ПоказательРасчетаРасходаТоплива = СтрокаПоказателя.ПоказательРасчетаРасходаТоплива;
		
		ПараметрыОтбора = Новый Структура("ОбъектРасчета, ПоказательРасчетаРасходаТоплива", Объект.Ссылка, ПоказательРасчетаРасходаТоплива);
		
		СтруктураПараметров = Новый Структура("Отбор", ПараметрыОтбора);
		
		ОповещениеПриЗакрытии = Новый ОписаниеОповещения("ОбновитьПоказателиПослеЗакрытияФормыВыбора", ЭтотОбъект);
		
		ОткрытьФорму("РегистрСведений.CW_ЗначенияПоказателейНормРасходаТоплива.Форма.ФормаРедактированияСписка",СтруктураПараметров,ЭтаФорма,,,,ОповещениеПриЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВсеПоказатели(Команда)
	
	ОтображатьВсеПоказатели = не ОтображатьВсеПоказатели;
	
	УстановитьСнятьОтборПоказателей();
	ОбновитьКартинкуКнопки();

КонецПроцедуры

&НаСервере
Процедура УстановитьСнятьОтборПоказателей()
	
	Если ОтображатьВсеПоказатели Тогда
		ТекущийОтбор = Неопределено;
	Иначе
		ТекущийОтбор = Новый ФиксированнаяСтруктура("Отображать", Истина)
	КонецЕсли;
		
	Элементы.ПоказателиНормРасходаТоплива.ОтборСтрок = ТекущийОтбор;
	
КонецПроцедуры

&НаСервере
Процедура ВидТСПриИзмененииНаСервере()
	
	Если Объект.ВидТС <> Объект.ТипТранспортногоСредства.ВидТС Тогда
		Объект.ТипТранспортногоСредства = Неопределено;
	КонецЕсли;
	
	УстановитьНеобходимостьДвигателя();

	Если ДвигательНеПредусморен Тогда
		Объект.ТипДвигателяТС 			= ПредопределенноеЗначение("Перечисление.CW_ТипыДвигателейТС.Отсутствует");
	КонецЕсли;
	
	Объект.ТопливныйБакОтсутствует  = ДвигательНеПредусморен;

	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНеобходимостьДвигателя()
	
	ДвигательНеПредусморен = Объект.ВидТС = ПредопределенноеЗначение("Перечисление.CW_ВидыТС.Прицеп") или Объект.ВидТС = ПредопределенноеЗначение("Перечисление.CW_ВидыТС.ПустаяСсылка"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ВидТСПриИзменении(Элемент)
	
	ВидТСПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипДвигателяТСПриИзменении(Элемент)
	
	ОчиститьПараметрыДвигателя();
	_УправлениеЭлементамиФормы();	
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьПараметрыДвигателя()
	
	Объект.МодельДвигателя       = Неопределено;
	Объект.МощностьДвигателяКВТ  = Неопределено;
	Объект.МощностьДвигателяЛС   = Неопределено;
	Объект.ОбъемДвигателя        = Неопределено;
	Объект.ОбъемТопливногоБака	 = Неопределено;
	
	Объект.ВидыТоплива.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Объект.ПолноеНаименование = Объект.Наименование;
КонецПроцедуры

&НаКлиенте
Процедура ТипТранспортногоСредстваПриИзменении(Элемент)
	
	_УстановитьПараметрыФункциональныхОпцийФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипТранспортногоСредстваНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.ВидТС) Тогда
		СтандартнаяОбработка = Ложь;
		
		Сообщение = новый СообщениеПользователю;
		Сообщение.Текст 		= "Не выбран Вид транспортного средства!";
		Сообщение.ПутьКДанным 	= "Объект";
		Сообщение.Поле 			= "ВидТС";
	    Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиНормРасходаТопливаПередУдалением(Элемент, Отказ)
	Отказ = истина;
КонецПроцедуры
	
#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти
